{"data":{"contentfulEvent":{"id":"f5409788-94e4-56f9-965b-18a0a5df4aaf","name":"Rick ","individualEventPicture":{"file":{"url":"//images.ctfassets.net/n2o4hgsv6wcx/3T9XdPgwbYSOua8eiM4SIQ/0978575d427fde02ff857f624c9e2aed/r_m_sauce.0.jpg"},"title":"r m sauce.0","description":""},"eventCategories":["Cabaret and Variety","Talks and Debates","Plays and Theatre"],"performances":null,"eventDescription":{"eventDescription":"Not so fast Morty, you heard your mom. We've got adventures to go on Morty. Just you and me. And sometimes your sister and sometimes your mom but never your dad. You wanna know why Morty? Because he crossed me. Oh it gets darker Morty. Welcome to the darkest year of our adventures. First thing that's different, no more dad Morty. He threatened to turn me in to the government. So I made him and the government go away. I've replaced them both as the de facto patriarch of your family and your universe. Your mom wouldn't have accepted me if I came home without you and your sister, so now you know the real reason I rescued you. I just took over the family Morty and if you tell your mom or sister I said any of this, I'll deny it. And they'll take my side because I'm a hero Morty. And now you're gonna go and do whatever I say Morty. Forever. And I'll go out and I'll find some more of that Mulan Szeschuan Teriyaki dipping sauce Morty. Because that's what this is all about Morty. That's my one-arm man. I'm not driven by avenging my dead family Morty. That was fake. I'm driven by finding that Mcnugget sauce. I want that Mulan Mcnugget sauce Morty. That's my series arc Morty. If it takes nine seasons. I want my Mcnugget dipping sauce Szeschuan sauce Morty. That's what's going to take us all the way to the end Morty. Season nine more seasons Morty. Nine more seasons until I get that dipping Szeschuan sauce. For ninety-seven more years Morty. I want that Mcnugget sauce Morty"},"location":{"lat":51.50110434083253,"lon":-0.14179229736328125},"locationName":"Buckingham Palace","addressLine1":null,"addressLine2":null,"city":null,"postcode":null,"startTime":"2019-03-31T08:00+00:00","endTime":"2019-03-31T11:30+00:00","eventPriceLow":0,"eventPriceHigh":0,"email":null,"phone":null,"ticketingUrl":null,"accessibilityOptions":["Step free access","Accessible Toilets","Hearing loop installed","Service animals welcome"],"venueDetails":["Outdoors"]}},"pageContext":{"id":"f5409788-94e4-56f9-965b-18a0a5df4aaf","startDate":"31 Mar 2019","endDate":"31 Mar 2019","startTime":"9am","endTime":"12:30pm"}}