{"data":{"contentfulGenericContentPage":{"id":"ac4daf09-6145-5e1a-8e5a-e877456bc8f7","title":"Accessibility at Pride","subtitle":"Need a hand getting around? We have you covered.","bannerImage":null,"bannerColor":"#00A3BD","content":{"content":"**We want to make sure Pride in London provide a platform for every part of London's LGBT+ community including Deaf and disabled people to campaign and raise awareness of LGBT+ issues.**\n\nYou'll find information on access provisions for the Pride in London Parade event on this page, however, if you have a question about accessibility that isn't answered here then please contact us at:\n\n**07539 196 313** (via call, text, Whatsapp) or [access@prideinlondon.org](mailto:access@prideinlondon.org)\n\n\n## Getting to Pride\n\n![parade-transport](//images.ctfassets.net/n2o4hgsv6wcx/2cJBnJa5BOUy2MgQo4GQm/e7f9fbfb6f26ad6fa90ca4dcd7951f69/parade-transport.jpeg)\n\n### By tube\n\n#### For the Parade Route\nOxford Circus, Piccadilly Circus, and Charing Cross\n\n#### For the Parade Access Safe Space\nOxford Circus, Great Portland Street, Regent’s Park. The Access Safe Space assembly area is where Riding House Street meetings Great Portland Street.\n\n#### For Trafalgar Square Main Stage\nCharing Cross, Embankment\n\n#### For Leicester Square Women’s Stage\nLeicester Square\n\nTo check which tube stations are step-free and for further info on accessibility and the tube, visit the [TFL website](https://tfl.gov.uk/forms/12387.aspx).\n\n### By car\n\nWe have a small number of free accessible parking places at the [Q-Park in Chinatown](http://www.q-park.co.uk/parking/parkingid/1961). Please email us to ask about booking these places. The maximum height for vehicles is 1.98m (6ft 5in), although we will try to find another parking area if your vehicle is too tall. Our shuttle bus can then take you to the Parade Access Safe Space or Trafalgar Square.\n\n### Access shuttle bus\n\nTwo wheelchair accessible shuttle buses will available on the day. These will run approx every 30 minutes between 8:45am and 12pm (midday).\n\nIf you would like to use our Shuttle Bus please find the pick up and drop off points below:\n\n#### Pick Up\n\n- Q Park in China Town (WC2H 7PR)\n- Northwest corner of Trafalgar Square, (Outside St Martin-in-the-Fields Church)\n- Kings Cross (26 York Way, N1 9AA. Outside Premier Inn)\n\n#### Drop off\n\n- Trafalgar Square (outside St Martin-in-the-Fields Church)\n- Parade Access Safe Space (where Riding House Street meets Great Portland Street W1B 2QS)\n\nWe will run a shuttle from Trafalgar Square (outside St Martin-in-the-Fields Church) at 8:15pm back to Q Park, Kings Cross.\n\nThe bus will be clearly identiﬁable with Pride signs in the windows and our Access volunteers (with bright orange T-shirts) on-board.\n\n## Accessibility at the parade\n\n![page-accessibility-at-the-parade](//images.ctfassets.net/n2o4hgsv6wcx/6D93QCHkI0WeKgI0EeYAIe/af74d858b5ffb18d57028c1f64f56821/page-accessibility-at-the-parade.jpg)\n\n### Joining the parade\n\nWe offer a Parade Safe Space for anyone of identifies as Deaf or disabled or has additional support needs. Located near the front in a quieter section of the parade, we have a hop-on hop-off wheelchair accessible bus and a fantastic team of trained access volunteers and BSL interpreters. We are also service animal friendly.\n\n![Voluntters-Access+Assembly+Point+-+laura+williams](//images.ctfassets.net/n2o4hgsv6wcx/2XsWVHcJyEcUmQasGeMO4a/faf57838cae1bb7c4563d3488c4b604e/Voluntters-Access_Assembly_Point_-_laura_williams.JPG)\n\n### Access assembly point\n\nIf you want to join the access safe space for the Parade, please arrive at our assembly point by 12:30pm. The Parade Starts promptly at 1pm.\n\nThere is no need to book- you can just turn up on the day. Please be aware spaces are limited and will be offered on a first come, first serve basis. Personal Assistants/Support Workers/Carers/Family/Friends are welcome.\n\nThe access assembly point is where Riding House Street meets Great Portland Street. Check our travel tips above for more information on how to get there.\n\n![acessibility+point+map](//images.ctfassets.net/n2o4hgsv6wcx/6HnAQKzUhqYuAaEE4yiK6y/eeabc7c4436cb2ba1b651e7af1234636/acessibility_point_map.png)\n\nOur volunteers and a BSL interpreter will be there from 10:30am to welcome you and answer any questions you may have about the rest of your day.\n\nThere will be an accessible toilet available\n\nThe Parade starts at 1pm. Our Access Volunteers be there to help us move from the access assembly point into the parade. Volunteers also travel the route of the parade with you.\n\nAlthough we are at a quieter section of the parade, it is still very noisy and as we travel the Parade route spectators will be clapping and cheering. We do not allow whistles or megaphones in the Safe Space as we want to reduce the immediate noise for people in our group with sensory sensitivities and service animals.\n\nYou are welcome to bring banners with you but our volunteers cannot help you carry them.\n\nOnce the parade has started, if you wish to leave you can do so at set points, but it is not possible to re-join, so if you have plans to meet friends arrange to do so when you reach Trafalgar Square.\n\nIt takes approximately 2 hours to travel the parade route.\n\nWe do have a shuttle bus that will travel with us that can be used for rest, or as somewhere quieter to experience the parade from. The shuttle continues with the Safe Space to Trafalgar Square – again with our volunteers on board.\n\n![Parade+Shuttle+Bus-Access+-+laura+williams](//images.ctfassets.net/n2o4hgsv6wcx/OMhkN2WfQW84AcwQ2WE4Q/5f9052662ec500c6e0975d69d8a281a0/Parade_Shuttle_Bus-Access_-_laura_williams.JPG)\n\nWe follow the Parade Route down to Trafalgar Square where we leave the parade route before the rest of the parade ends on Whitehall.\n\n### Arriving at Trafalgar Square from the Parade\n\nWhen the Parade reaches Cockspur Street, the Access Safe Space will leave the Parade and move down Pall Mall East. Access volunteers will then lead the group to the Trafalgar Square viewing platform where we have a direct view of the stage, speech to text and BSL interpreters on the screens. We also have a ‘changing places’ mobiloo toilet, a wheelchair charging point, a rest area for service animals and a quiet rest tent if space away from the crowds is needed.\n\n\n## Accessibility at Trafalgar Square\n![Trafalgar+Square-Viewing+Platform+2+-+laura+williams](//images.ctfassets.net/n2o4hgsv6wcx/3M5ZTNowbuSeGmm0ua82KK/fdef85aa733af211bc2d58187ca67108/Trafalgar_Square-Viewing_Platform_2_-_laura_williams.JPG)\n\n\n### Viewing platform\nWe offer an accessible viewing platform in Trafalgar Square which will be right in the heart of the square on the North Terrace, staffed by a dedicated Access Manager and volunteer stewards, with support from our Security provider.\n\n![Trafalgar+Square+Viewing+Platform+-+laura+williams](//images.ctfassets.net/n2o4hgsv6wcx/43pZQSPuowCO4cGAKqOWg6/0414f16decab2a884b1346fc7b817519/Trafalgar_Square_Viewing_Platform_-_laura_williams.JPG)\n\nDue to the structure limitations, it will not be possible to provide cover from adverse weather conditions, so please bring an umbrella (and if needed, an umbrella clamp) that can be used to shelter from rain or excess heat!\n\nIn Trafalgar Square we also provide:\n\n- Service animal rest area\n- Wheelchair charging point\n- Quiet tent (which can be used for rest or as somewhere quieter to have a break from the event- this is not soundproof. A live feed from the main stage will be screened inside the tent)\n- Accessible toilet next to the viewing platform.\n- Induction loop running around the entire viewing platform\n- Roaming BSL Interpreter\n- Changing Places Mobiloo toilet\n- First Aid point\n\n### Main stage\n\nOn the main stage, we will have a BSL interpreter. Our screens will have both an interpreter, and a live speech-to-text service."}}},"pageContext":{"id":"ac4daf09-6145-5e1a-8e5a-e877456bc8f7"}}